OpenFOAM/gasThermoCoupled-OFv2112/cases/laminar/0/wedgeAndSlip
front
{
    type    wedge;
}

back
{
    type    wedge;
}

defaultFaces
{
    type    slip;
}

